{"recipe_uuid4": ["c894834d-c0b4-46c2-8311-59bcaf2d288e"], "recipe_id": ["277219"], "link": ["https://www.allrecipes.com/recipe/277219/pumpkin-gnocchi-in-sage-sauce/"], "ingredient_list": ["1 large russet potato", "1 cup pumpkin puree", "2 cups all-purpose flour, or as needed", "1 egg, whisked", "2 teaspoons salt, divided", "1 tablespoon oil, or as needed", "4 tablespoons salted butter", "2 tablespoons salted butter", "1 clove minced garlic", "5 leaves fresh sage, chopped", "1 tablespoon heavy cream", "1 tablespoon all-purpose flour, or more as needed"], "recipe_meta": ["Prep: 30 mins", "Cook: 35 mins", "Total: 1 hr 5 mins", "Servings: 4", "Yield: 4 servings"], "direction_steps": ["Step 1", "Step 2", "Step 3", "Step 4", "Step 5", "Step 6"], "directions_instructions": ["Prick holes in potato with a fork and place in a microwave-safe dish. Microwave on high for 6 minutes.", "Remove potato from microwave and set aside until cool enough to handle. Peel off and discard skin. Grate potato with a cheese grater. Measure grated potato (you should have approximately 2 cups) and place into a large bowl. Mix in pumpkin puree. Add flour (an amount equal to the grated potato), whisked egg, and 1 teaspoon salt; mix until dough just comes together in a smooth, but not too sticky, ball.", "Roll dough on a lightly floured work surface into a rope. Flatten the rope slightly and cut into squares that are just under 1 inch. Dip a fork into oil, press lightly onto a square of dough, and roll the fork to create a gnocchi shape. Repeat to shape remaining gnocchi.", "Bring a large pot of water to a boil. Add remaining 1 teaspoon salt. Working in batches, drop gnocchi into boiling water in a single layer, and cook until they float to the top, 2 to 4 minutes. Remove with a slotted spoon to a plate and repeat with remaining gnocchi. Reserve 1/2 cup of the cooking water.", "Melt 4 tablespoons butter in a large skillet over medium heat. Working in batches, add gnocchi in single layers to the skillet and fry undisturbed until crispy on one side, 3 to 5 minutes. Remove to a plate and repeat with remaining gnocchi.", "Melt 2 tablespoons butter for the sauce in the same skillet over low heat. Add garlic and sage; cook until fragrant, 2 to 3 minutes. Whisk in heavy cream and flour; stir until the mixture becomes paste-like and light golden brown, 3 to 5 minutes. Gradually whisk 2 tablespoons of the reserved cooking water into the flour mixture. Continue to whisk in cooking water, 2 tablespoons at a time, until sauce is desired consistency. Add gnocchi to the skillet and toss to coat with sauce. Transfer to a serving bowl or serve straight out of the skillet."], "nutrition_summary": ["542 calories; protein 11g; carbohydrates 71.4g; fat 24.1g; cholesterol 91.8mg; sodium 1455.9mg. Full Nutrition"]}