{"recipe_uuid4": ["fdbdaa8b-5140-43f4-94ef-1316b3260473"], "recipe_id": ["274339"], "link": ["https://www.allrecipes.com/recipe/274339/instant-pot-apricot-chicken-tagine/"], "ingredient_list": ["1 tablespoon vegetable oil", "1 large onion, finely sliced", "1 clove garlic, minced", "1 (1 inch) piece fresh ginger, grated", "1 tablespoon butter", "1 ½ teaspoons ground cinnamon", "1 teaspoon ground cumin", "1 pound skinless, boneless chicken thighs, cut into large chunks", "1 cup chicken broth", "1 cup chopped tomatoes", "6 fresh apricots, pitted and halved", "1 tablespoon honey", "3 ½ ounces cooked Israeli couscous (Optional)"], "recipe_meta": ["Prep: 20 mins", "Cook: 35 mins", "Additional: 20 mins", "Total: 1 hr 15 mins", "Servings: 4", "Yield: 4 servings"], "direction_steps": ["Step 1", "Step 2", "Step 3", "Step 4", "Step 5", "Step 6"], "directions_instructions": ["Turn on a multi-functional pressure cooker (such as Instant Pot®) and select Saute function.", "Heat vegetable oil in the hot cooker. Add onion and saute for 3 minutes. Stir in garlic and ginger and saute until fragrant, about 30 seconds. Stir in butter.", "Mix cinnamon and cumin together in a small bowl. Reserve 1 teaspoon of the mixture; set aside. Season chicken thighs with remaining cinnamon and cumin mixture.", "Place chicken into the Instant Pot® and sear, about 5 minutes per side. Pour in chicken broth and tomatoes. Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 10 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure using the natural-release method according to manufacturer's instructions for 15 minutes. Release remaining pressure carefully using the quick-release method according to manufacturer's instructions, about 5 minutes. Unlock and remove the lid.", "Place apricots into the liquid. Sprinkle chicken thighs with reserved 1 teaspoon cinnamon and cumin mixture. Drizzle honey over chicken thighs. Serve with tomato mixture on top of couscous."], "nutrition_summary": ["377 calories; protein 24.4g; carbohydrates 36.1g; fat 15.1g; cholesterol 79.2mg; sodium 384.5mg. Full Nutrition"]}